#This is to test python

In [112]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
from datetime import datetime, date, time

In [113]:
#List, Dictionary, Tuple
#Lists:
myList = [10, 20, 30, 40, 50, 60, 70, 80, 90]
print(myList)
myList[3:]

[10, 20, 30, 40, 50, 60, 70, 80, 90]

[40, 50, 60, 70, 80, 90]

In [114]:
x = [1, "b", 3]

In [115]:
x[1]

'b'

In [116]:
#dictionary:

dict = {"vibeus": "Dating app",
        "Plutter" : "Social Media",
        "Viber" : "Communication application"}
dict["vibeus"]

'Dating app'

In [117]:
students = {"Mohammed": ["IBM"],
            "Raza" : ["INFY", "Wipro", "Google"],
            "Khan" : ["FaceBook", "Plutter", "Vibeus", "Connect"]
           
           }
students["Raza"][2]

'Google'

In [118]:
#Tuples
tup_ex = (1,2,3)
MyList = [1,2,3,4,]
MyList.append(7)
MyList

[1, 2, 3, 4, 7]

In [119]:
!pip install pandas

Requirement already satisfied: pandas in ./miniconda3/lib/python3.8/site-packages (1.2.0)
Requirement already satisfied: python-dateutil>=2.7.3 in ./miniconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in ./miniconda3/lib/python3.8/site-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.3 in ./miniconda3/lib/python3.8/site-packages (from pandas) (2020.5)
Requirement already satisfied: six>=1.5 in ./miniconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [120]:
#Read Data 
import pandas as pd
#import numpy as np
df = pd.read_excel("P2 Viva Scuedule.xlsx")

In [121]:
df.head(n = 5)

  Enrl. No.             Name Batch                            Date of P2 Viva
0   201B003      Abhay Singh    A2  Jan 13. 2021                     09:30 AM
1   201B005   Abhijeet Verma    A2                                        NaN
2   201B014     Aditi Mishra    A2                                        NaN
3   201B018      Aditya Rana    A2                                        NaN
4   201B023  Aditya Tripathi    A2                                        NaN

In [122]:
df.tail()

    Enrl. No.                   Name Batch Date of P2 Viva
86    201D004  Sanjeev Kumar Ahirwar    A2             NaN
87    201E002          Akshat Shukla    A2             NaN
88    201E003      Arindam Mukherjee    A2             NaN
89    201E005            Kritik Rana   A-2             NaN
90    201E007      Parth Singh Pawar    A2             NaN

In [123]:
df.shape

(91, 4)

In [124]:
df.dtypes

Enrl. No.          object
Name               object
Batch              object
Date of P2 Viva    object
dtype: object

In [125]:
df.describe(include= "all")

,Enrl. No.,Name,Batch,Date of P2 Viva
count,91,91,91,6
unique,91,91,4,6
top,201B122,Kriti Gupta,A2,"Jan 20, 2021 09:30 AM"
freq,1,1,86,1

In [126]:
temp = pd.DataFrame({
    "No." : ["1", "2", "3", "4"],
    "Name" :["Raza", "Sana", "Ziyan", "Shayan"], 
    "age" : [18, 10, 4, 0.5],
    "mother name" : ["Zarina", "Zarina", "Reshma", "Reshma"],
    "Father name": ["Yunus", "Yunus", "Kalim", "Kalim"],
    "Schooling" : ["PHS", "CEHS", "null", "null"],
    "Job": ["Founder and CEO", "null", "null", "null"],
    "DOB": ['2002-october-08', '2011-january-27', '2016-september-26', '2020-August-03']
    })

In [127]:
temp

,No.,Name,age,mother name,Father name,Schooling,Job,DOB
0,1,Raza,18.0,Zarina,Yunus,PHS,Founder and CEO,2002-october-08
1,2,Sana,10.0,Zarina,Yunus,CEHS,null,2011-january-27
2,3,Ziyan,4.0,Reshma,Kalim,null,null,2016-september-26
3,4,Shayan,0.5,Reshma,Kalim,null,null,2020-August-03

In [128]:
temp.dtypes

No.             object
Name            object
age            float64
mother name     object
Father name     object
Schooling       object
Job             object
DOB             object
dtype: object

In [129]:
pd.to_datetime(["2002-jun-02", "2002-october-02"])

DatetimeIndex(['2002-06-02', '2002-10-02'], dtype='datetime64[ns]', freq=None)

In [130]:
temp

,No.,Name,age,mother name,Father name,Schooling,Job,DOB
0,1,Raza,18.0,Zarina,Yunus,PHS,Founder and CEO,2002-october-08
1,2,Sana,10.0,Zarina,Yunus,CEHS,null,2011-january-27
2,3,Ziyan,4.0,Reshma,Kalim,null,null,2016-september-26
3,4,Shayan,0.5,Reshma,Kalim,null,null,2020-August-03

In [131]:
temp["DOB"] = pd.to_datetime(temp["DOB"])
temp
temp.dtypes
#ye use karte hai agar hum etime stam read farna hai toh👇🏻
pd.to_datetime(["2015-sep-11", "abc"], errors = "coerce")

,No.,Name,age,mother name,Father name,Schooling,Job,DOB
0,1,Raza,18.0,Zarina,Yunus,PHS,Founder and CEO,2002-10-08
1,2,Sana,10.0,Zarina,Yunus,CEHS,null,2011-01-27
2,3,Ziyan,4.0,Reshma,Kalim,null,null,2016-09-26
3,4,Shayan,0.5,Reshma,Kalim,null,null,2020-08-03

No.                    object
Name                   object
age                   float64
mother name            object
Father name            object
Schooling              object
Job                    object
DOB            datetime64[ns]
dtype: object

DatetimeIndex(['2015-09-11', 'NaT'], dtype='datetime64[ns]', freq=None)

In [132]:
temp["No."] = pd.to_numeric(temp["No."])
temp
temp.dtypes

,No.,Name,age,mother name,Father name,Schooling,Job,DOB
0,1,Raza,18.0,Zarina,Yunus,PHS,Founder and CEO,2002-10-08
1,2,Sana,10.0,Zarina,Yunus,CEHS,null,2011-01-27
2,3,Ziyan,4.0,Reshma,Kalim,null,null,2016-09-26
3,4,Shayan,0.5,Reshma,Kalim,null,null,2020-08-03

No.                     int64
Name                   object
age                   float64
mother name            object
Father name            object
Schooling              object
Job                    object
DOB            datetime64[ns]
dtype: object

Yup will use describe function in on temp

In [133]:
temp.describe(
       include = "all"
)

<ipython-input-133-af7569076086>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  temp.describe(

,No.,Name,age,mother name,Father name,Schooling,Job,DOB
count,4.000000,4,4.000000,4,4,4,4,4
unique,NaN,4,NaN,2,2,3,2,4
top,NaN,Sana,NaN,Reshma,Kalim,null,null,2020-08-03 00:00:00
freq,NaN,1,NaN,2,2,2,3,1
first,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2002-10-08 00:00:00
last,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2020-08-03 00:00:00
mean,2.500000,NaN,8.125000,NaN,NaN,NaN,NaN,NaN
std,1.290994,NaN,7.663496,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,0.500000,NaN,NaN,NaN,NaN,NaN
25%,1.750000,NaN,3.125000,NaN,NaN,NaN,NaN,NaN
50%,2.500000,NaN,7.000000,NaN,NaN,NaN,NaN,NaN
75%,3.250000,NaN,12.000000,NaN,NaN,NaN,NaN,NaN
max,4.000000,NaN,18.000000,NaN,NaN,NaN,NaN,NaN

In [134]:
df["Name"].value_counts()

Kriti Gupta       1
V Soumya          1
Shubham Shukla    1
Devansh Pandey    1
Ronak Kumbhat     1
                 ..
Samay Rathi       1
Ravinder Singh    1
Aman Uttam        1
Rishit Sharma     1
Yash Parihar      1
Name: Name, Length: 91, dtype: int64

In [136]:
df["Batch"].value_counts()

A2          86
A-2          2
a2           2
A2 batch     1
Name: Batch, dtype: int64

In [144]:
temp["Father name"].value_counts()

Kalim    2
Yunus    2
Name: Father name, dtype: int64